collected-data/gfs-4-rep-results/experiements-1-3/8-failure/tfd/fio-gfs-test-low-rand-write-tfd.txt
Started: 15-04-2022--23-13-30

low-rand-write-/mnt/gfs: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
fio: pid=7998, err=107/file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected

low-rand-write-/mnt/gfs: (groupid=0, jobs=1): err=107 (file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected): pid=7998: Fri Apr 15 23:13:41 2022
  write: IOPS=24, BW=3093KiB/s (3168kB/s)(21.9MiB/7241msec); 0 zone resets
    slat (nsec): min=34362, max=65302, avg=39206.80, stdev=3740.50
    clat (msec): min=23, max=310, avg=41.10, stdev=23.18
     lat (msec): min=23, max=310, avg=41.15, stdev=23.18
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   24], 10.00th=[   24], 20.00th=[   24],
     | 30.00th=[   35], 40.00th=[   46], 50.00th=[   47], 60.00th=[   47],
     | 70.00th=[   47], 80.00th=[   47], 90.00th=[   47], 95.00th=[   48],
     | 99.00th=[   82], 99.50th=[  309], 99.90th=[  309], 99.95th=[  309],
     | 99.99th=[  309]
   bw (  KiB/s): min= 2304, max= 5376, per=99.31%, avg=3072.43, stdev=881.74, samples=14
   iops        : min=   18, max=   42, avg=23.93, stdev= 6.84, samples=14
  lat (msec)   : 50=94.89%, 100=3.98%, 500=0.57%
  cpu          : usr=0.01%, sys=0.08%, ctx=353, majf=0, minf=45
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.6%, 4=99.4%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,176,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3093KiB/s (3168kB/s), 3093KiB/s-3093KiB/s (3168kB/s-3168kB/s), io=21.9MiB (22.9MB), run=7241-7241msec
low-rand-write-/mnt/gfs: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
fio: pid=8155, err=107/file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected

low-rand-write-/mnt/gfs: (groupid=0, jobs=1): err=107 (file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected): pid=8155: Fri Apr 15 23:17:58 2022
  write: IOPS=18, BW=2409KiB/s (2466kB/s)(15.8MiB/6696msec); 0 zone resets
    slat (nsec): min=34572, max=58388, avg=39141.94, stdev=3133.29
    clat (msec): min=23, max=1045, avg=52.87, stdev=89.37
     lat (msec): min=23, max=1045, avg=52.91, stdev=89.37
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   35], 10.00th=[   35], 20.00th=[   46],
     | 30.00th=[   46], 40.00th=[   47], 50.00th=[   47], 60.00th=[   47],
     | 70.00th=[   47], 80.00th=[   47], 90.00th=[   47], 95.00th=[   47],
     | 99.00th=[   89], 99.50th=[ 1045], 99.90th=[ 1045], 99.95th=[ 1045],
     | 99.99th=[ 1045]
   bw (  KiB/s): min=  512, max= 3584, per=100.00%, avg=2603.08, stdev=722.68, samples=12
   iops        : min=    4, max=   28, avg=20.33, stdev= 5.65, samples=12
  lat (msec)   : 50=94.49%, 100=3.94%, 2000=0.79%
  cpu          : usr=0.00%, sys=0.07%, ctx=254, majf=0, minf=48
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.8%, 4=99.2%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,127,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2409KiB/s (2466kB/s), 2409KiB/s-2409KiB/s (2466kB/s-2466kB/s), io=15.8MiB (16.5MB), run=6696-6696msec
low-rand-write-/mnt/gfs: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
fio: pid=8279, err=107/file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected

low-rand-write-/mnt/gfs: (groupid=0, jobs=1): err=107 (file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected): pid=8279: Fri Apr 15 23:21:51 2022
  write: IOPS=21, BW=2730KiB/s (2796kB/s)(19.5MiB/7314msec); 0 zone resets
    slat (nsec): min=33174, max=59784, avg=39147.22, stdev=3275.38
    clat (msec): min=23, max=629, avg=45.76, stdev=48.76
     lat (msec): min=23, max=629, avg=45.80, stdev=48.76
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   24], 10.00th=[   24], 20.00th=[   35],
     | 30.00th=[   39], 40.00th=[   46], 50.00th=[   46], 60.00th=[   47],
     | 70.00th=[   47], 80.00th=[   47], 90.00th=[   47], 95.00th=[   47],
     | 99.00th=[  155], 99.50th=[  625], 99.90th=[  625], 99.95th=[  625],
     | 99.99th=[  625]
   bw (  KiB/s): min= 1024, max= 3584, per=99.78%, avg=2724.93, stdev=546.25, samples=14
   iops        : min=    8, max=   28, avg=21.29, stdev= 4.27, samples=14
  lat (msec)   : 50=95.54%, 100=2.55%, 250=0.64%, 750=0.64%
  cpu          : usr=0.01%, sys=0.07%, ctx=314, majf=0, minf=48
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.6%, 4=99.4%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,157,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2730KiB/s (2796kB/s), 2730KiB/s-2730KiB/s (2796kB/s-2796kB/s), io=19.5MiB (20.4MB), run=7314-7314msec